import './index.less'

const Marry = () => {
  return (
    <div className={'marry'}>
      <h1>IF YOU</h1>
      <div className="marray__content">
        亲爱的66
        {'\n'}
        <br />
        此刻我即将写我的誓词卡，我文笔不怎么样，所以我就意识流地写下下面的文字吧。大概在来浙江的前几天，我一个人
        在家的时候又不小心晚睡了，于是我就又打开了你的《唱吧》，最近的一首歌曲是2020.12.10的《歌唱者》，那天是我的生日。“你看这样的我，是否是你
        眼中完美的角色”，歌词如是写到，那年生日，丰哥，超哥，花花，莉莉做了我的助攻，拉进了我们之间的距离，从那以后我们每天都要聊天，下班后一起遛芝麻，芝麻总是绕着走，导致绳子经常直接绑住我们，
        公司同事还给我们起了CP名————“龙阳路”，就这样在同事朋友和小芝麻的助攻下，我们在2021.1.17号正式在一起了。
        {'\n'}
        <br />
        到今天为也有805天啦!这805天里，99%的时间我们都是开开心心，没心没肺的度过，我还记得我们搬来现在的住处的时候，那天天气很好，我们
        被搬家师傅坑了800块钱，但是我并不在意，因为那天是我们正式同居的开始，那不仅仅代表着有人和我一起分摊房租了，更是代表着在这个陌生的城市，我忙碌了一天回到家，我知道有人在等我（虽然后来大部分时间是我比较早到家），那也代表着我该是为了我们的
        未来好好的努力了。2021.4.8我离开了携程，去B站为爱发电，虽然有不舍，但是你依旧支持我。也许有很多人不理解我，但是有你的支持我觉得就够了。从刚开始的不顺，到后来的晋升，年终奖，我知道，没有你的鼓励和支持我是坚持不下来的，希望我没有让你失望。
        当然也有1%的时间是比较苦涩的，21年国庆你被定为密接，需要隔离7天，你被封在宾馆， 我没有照顾到你的情绪，我们大吵了一家。你气的打电话给思思，以至于我在30号接小芝麻的时候被思思“教育”了，那次国庆我没有出去，在家照顾小芝麻，每天与你视频哄你开心，
        庆幸最后不需要再隔离，我也在晚上和小芝麻接到了解封的你。
        {'\n'}
        <br />
        你经常问我是什么时候开始喜欢你的，其实我无法确定。但是我记得在20年的某一天，那天下着雨，我的心情很差，你在pyq发了一首你自弹自唱的《七里香》，当时和你不熟，但是听你唱了之后，我的心情有释然很多...
        {'\n'}
        <br />
        回忆是很美好的，从不熟悉，到现在你站在我面前，因为有你，我对未来的生活充满了期待。岁月会无声走过，我会守着你，一直站在你身旁。❤️
      </div>
      <span>2023.4.1于我和我的兔子先生</span>
    </div>
  )
}

export default Marry
